//Чем похожи класс и интерфейс?

//        Интерфейс схож с классом следующим образом:
//
//       - Интерфейс может содержать любое количество методов.
//       - Интерфейс записан в файле с расширением .java, и имя интерфейса совпадает с именем файла.
//       - Байт-код интерфейса находится в ".class файле".
//       - Интерфейсы появляются в пакетах, и их соответствующий файл байт-кода должен быть в структуре каталогов,
//        которая совпадает с именем пакета.


//        Отличие интерфейса от класса в Java:
//
//       - Вы не можете создать экземпляр интерфейса.
//       - В интерфейсе не содержатся конструкторы.
//       - Все методы в интерфейсе абстрактные.
//       - Интерфейс не может содержать поля экземпляров. Поля, которые могут появиться в интерфейсе,
//       обязаны быть объявлены и статическими, и final.

//       - Интерфейс не расширяется классом, он реализуется классом.
//       - Интерфейс может расширить множество интерфейсов.

// http://proglang.su/java/interfaces
// https://hr-vector.com/java/polimorfizm
// https://habr.com/ru/company/otus/blog/429120/