public class ArephmeticOperations {
    public static void main(String[] args) {
        System.out.println(5 / 2);// =2
//При делинии числа, ну напрмер целого на целое, в резудьтат ппадает только целое число, указывающее на то,
// сколько делитей помещается в делимом. БЕЗ ОКРУГЛЕНИЙ, ДАЖЕ ЕСЛИ 2,9999 - только целая часть.

        System.out.println(5 % 2);// =1
        System.out.println(11 % 2);// =
//Операнд называется остаток от деления. В каком то смысле, результат противоположный делению - в ответ попадает
//та часть, которая не делится нацело. Ну, то есть от числа 5 часть которая равна 4 делится ровно на два
// а часть 1 не делиться нацело.



    }
}
